analogdevicesinc/MAX78xxx-RefDes/maxrefdes178/max32666_libraries/BTLE/link_layer/platform/common/include/hci_defs.h
/** \name All PHYs preference
 *
 */
/**@{*/
#define HCI_ALL_PHY_ALL_PREFERENCES                  0x00    /*!< \brief All PHY preferences */
#define HCI_ALL_PHY_TX_PREFERENCE_BIT                (1<<0)  /*!< \brief Tx PHY preference */
#define HCI_ALL_PHY_RX_PREFERENCE_BIT                (1<<1)  /*!< \brief Rx PHY preference */
/**@}*/

/** \name PHY options
 *
 */
/**@{*/
#define HCI_PHY_OPTIONS_NONE                         0x00    /*!< \brief No preferences */
#define HCI_PHY_OPTIONS_S2_PREFERRED                 0x01    /*!< \brief S=2 coding preferred when transmitting on LE Coded PHY */
#define HCI_PHY_OPTIONS_S8_PREFERRED                 0x02    /*!< \brief S=8 coding preferred when transmitting on LE Coded PHY */
/**@}*/

/** \name CTE Slot Durations
*
*/
/**@{*/
#define HCI_CTE_SLOT_DURATION_NONE                   0x00    /*!< \brief No switching and sampling */
#define HCI_CTE_SLOT_DURATION_1_US                   0x01    /*!< \brief Switching and sampling slots are 1 us each */
#define HCI_CTE_SLOT_DURATION_2_US                   0x02    /*!< \brief Switching and sampling slots are 2 us each */
/**@}*/

/** \name Permitted CTE Type bits
*
*/
/**@{*/
#define HCI_CTE_TYPE_PERMIT_AOA_RSP_BIT              (1<<0)  /*!< \brief Allow AoA Constant Tone Extension Response */
#define HCI_CTE_TYPE_PERMIT_AOD_RSP_1_US_BIT         (1<<1)  /*!< \brief Allow AoD Constant Tone Extension Response with 1 us slots */
#define HCI_CTE_TYPE_PERMIT_AOD_RSP_2_US_BIT         (1<<2)  /*!< \brief Allow AoD Constant Tone Extension Response with 2 us slots */
/**@}*/

/** \name Requested CTE Types
*
*/
/**@{*/
#define HCI_CTE_TYPE_REQ_AOA                         0x00    /*!< \brief AoA Constant Tone Extension */
#define HCI_CTE_TYPE_REQ_AOD_1_US                    0x01    /*!< \brief AoD Constant Tone Extension with 1 us slots */
#define HCI_CTE_TYPE_REQ_AOD_2_US                    0x02    /*!< \brief AoD Constant Tone Extension with 2 us slots */
/**@}*/

/** \name Bluetooth core specification versions
 *
 */
/**@{*/
#define HCI_VER_BT_CORE_SPEC_4_0                     0x06    /*!< Bluetooth core specification 4.0 */
#define HCI_VER_BT_CORE_SPEC_4_1                     0x07    /*!< Bluetooth core specification 4.1 */
#define HCI_VER_BT_CORE_SPEC_4_2                     0x08    /*!< Bluetooth core specification 4.2 */
#define HCI_VER_BT_CORE_SPEC_5_0                     0x09    /*!< Bluetooth core specification 5.0 */
#define HCI_VER_BT_CORE_SPEC_5_1                     0x0A    /*!< Bluetooth core specification 5.1 */
/**@}*/

/** \name Parameter lengths
 *
 */
/**@{*/
#define HCI_EVT_MASK_LEN                             8       /*!< \brief Length of event mask byte array */
#define HCI_EVT_MASK_PAGE_2_LEN                      8       /*!< \brief Length of event mask page 2 byte array */
#define HCI_LE_EVT_MASK_LEN                          8       /*!< \brief Length of LE event mask byte array */
#define HCI_FEAT_LEN                                 8       /*!< \brief Length of features byte array */
#define HCI_ADV_DATA_LEN                             31      /*!< \brief Length of advertising data */
#define HCI_SCAN_DATA_LEN                            31      /*!< \brief Length of scan response data */
#define HCI_EXT_ADV_DATA_LEN                         251     /*!< \brief Length of extended advertising data */
#define HCI_EXT_ADV_CONN_DATA_LEN                    191     /*!< \brief Length of extended connectable advertising data */
#define HCI_PER_ADV_DATA_LEN                         252     /*!< \brief Length of periodic advertising data */
#define HCI_EXT_ADV_RPT_DATA_LEN                     229     /*!< \brief Length of extended advertising report data */
#define HCI_PER_ADV_RPT_DATA_LEN                     247     /*!< \brief Length of periodic advertising report data */
#define HCI_CHAN_MAP_LEN                             5       /*!< \brief Length of channel map byte array */
#define HCI_KEY_LEN                                  16      /*!< \brief Length of encryption key */
#define HCI_ENCRYPT_DATA_LEN                         16      /*!< \brief Length of data used in encryption */
#define HCI_RAND_LEN                                 8       /*!< \brief Length of random number */
#define HCI_LE_STATES_LEN                            8       /*!< \brief Length of LE states byte array */
#define HCI_P256_KEY_LEN                             64      /*!< \brief Length of P256 key */
#define HCI_DH_KEY_LEN                               32      /*!< \brief Length of DH Key */

#define HCI_EXT_ADV_RPT_DATA_LEN_OFFSET              23      /*!< \brief Length field offset of extended advertising report data */
#define HCI_PER_ADV_RPT_DATA_LEN_OFFSET              6       /*!< \brief Length field offset of periodic advertising report data */
/**@}*/

/** \name Number of Antenna IDs in Switching Pattern
*
*/
/**@{*/
#define HCI_MIN_NUM_ANTENNA_IDS                      2       /*!< \brief Minimum number of Antenna IDs in switching pattern */
#define HCI_MAX_NUM_ANTENNA_IDS                      75      /*!< \brief Maximum number of Antenna IDs in switching pattern */
/**@}*/

/** \name IQ Report Sample Counts
*
*/
/**@{*/
#define HCI_IQ_RPT_SAMPLE_CNT_MIN                    9       /*!< \brief Minimum number of sample pairs in IQ report */
#define HCI_IQ_RPT_SAMPLE_CNT_MAX                    82      /*!< \brief Maximum number of sample pairs in IQ report */

#define HCI_CONN_IQ_RPT_SAMPLE_CNT_OFFSET            12      /*!< \brief Sample count field offset of connection IQ report */
/**@}*/

/** \name Company ID
 *
 */
/**@{*/
#define HCI_ID_ARM                                   0x005F  /*!< \brief ARM Ltd. company ID */
#define HCI_ID_MAXIM                                 0x058B  /*!< \brief Maxim Integrated Products company ID */
/**@}*/

/** \name Manufacturer location in Local version
 *
 */
/**@{*/
#define HCI_LOCAL_VER_MANUFACTURER_POS              4        /*!< \brief Manufacturer location in local version */
/**@}*/

/* \} */    /* STACK_HCI_API */

#ifdef __cplusplus
};
#endif

#endif /* HCI_DEFS_H */
